README.org
* Table of Contents :TOC_5:
- [[#a-gentle-introduction][A Gentle Introduction]]
  - [[#lecture-information][Lecture Information]]
    - [[#assignments][Assignments]]
  - [[#the-lecture-structure][The Lecture Structure]]
  - [[#code-supplement][Code Supplement]]
  - [[#reading-list][Reading List]]

* A Gentle Introduction

Welcome to the lecture materials for use in *B.Sc - Digital Image
Processing* where our focus will be on the topics of:

1. Fundamentals on discrete mathematics,
   - Convolution
   - Discrete Fourier Transform
   - Information Theory
2. Display technologies and Cameras,
   - Camera Types
   - Lenses used in Industry
3. Image processing techniques,
   - Morphological Operations
   - Historgram Operations
4. An example of using ML in image recognition techniques.

** Lecture Information

The details of the lecture are given below.

#+TAG-BEGIN: LECTURE INFORMATION
| DESCRIPTION   | VALUE                                                   |
|---------------+---------------------------------------------------------|
| Program Name  | Bachelor's program "Mechatronics Design and Innovation" |
| Module Name   | Image Processing                                        |
| Semester      | 5                                                       |
| Room          | Lecture Room                                            |
| Assessment(s) | Midterm Assignment (40 %) Final Assignment (60 %)       |
| Lecturer      | Daniel McGuiness                                        |
|---------------+---------------------------------------------------------|
| Software      | Python                                                  |
| Hardware      | -                                                       |
|---------------+---------------------------------------------------------|
| SWS Total     | 3                                                       |
|---------------+---------------------------------------------------------|
| Total Units   | 45                                                      |
|---------------+---------------------------------------------------------|
| ECTS          | 5                                                       |
| Lecture Type  | ILV                                                     |
#+TAG-END: LECTURE INFORMATION

*** Assignments

There will be two (*2*) assignments for this course.

The grade breakdown is as follows:

| DEFINITION            | GRADE (%) |
|-----------------------+-----------|
| Individual Assignment |        40 |
| Group Assignment      |        60 |
| Sum                   |       100 |

*Individual Assignment*

An individual assignment will be given to you to work on. This
assignment will consist of questions pertaining to concepts and image
processing techniques.

The grade breakdown is as follows:

| DEFINITION                    | GRADE (%) |
|-------------------------------+-----------|
| Report Style                  |        15 |
| Q1 - Blurring Filters         |        15 |
| Q2 - Image Channel Analysis   |        10 |
| Q3 - RNG Map Generation       |        10 |
| Q4 - Image Cleaning           |        10 |
| Q5 - Shape Recognition        |        30 |
| Q6 - Image Quality Comparison |        10 |
| Sum                           |       100 |

*NOTE:* The assignment is individual and is not meant to be worked as a
group. Once the code and the work is submitted it will be vetted against
a software to determine if any collusion has occured.

*Group Assignment*

The group assignment focuses on a student defined project which its
presentation will be done in the last 3 sessions of the course. You are
to come up with a group and a project within the first 3 weeks of the
lecture otherwise one will be given to you.

The grade breakdown is as follows:

| DEFINITION   | GRADE (%) |
|--------------+-----------|
| Report Style |        15 |
| Content      |        55 |
| Q & A        |        30 |
| Sum          |       100 |

In report writing students must declare their contribution to the work
and they will be asked regarding their field of work during the Q&A
(i.e., if Student A has worked with blurring filter he may be asked on
why a specific one is chosen and/or the concepts and maths behind the
said filter).

*NOTE:* Students will be graded based on their contribution to the
project and answers during the Q&A, therefore will be graded
individually.

** The Lecture Structure

As it currently is, the lecture covers topic from vision technologies
(i.e., camera, display) to methods in improving/analysing gathered
images. The structure of the lecture is shown below.


#+TAG-BEGIN: CORG-INDEX
| ORDER | TOPIC                                | DESCRIPTION                                                                       |
|-------+--------------------------------------+-----------------------------------------------------------------------------------|
|     1 | Introduction                         | Discussion of the lecture structure and what will be covered                      |
|     2 | [[/Users/danielmcguiness/GitHub/MCI-Source-Files/(BSc - Lecture) Digital Image Processing/Lecture Slides/DIP Slide/codes/Mathematical-Fundamentals.org][Mathematical Fundamentals]]            | Convolution, sampling theorem and Fourier analysis                                |
|     3 | [[/Users/danielmcguiness/GitHub/MCI-Source-Files/(BSc - Lecture) Digital Image Processing/Lecture Slides/DIP Slide/codes/Perception.org][Perception]]                           | Colour spaces and industry standards (i.e., colour science)                       |
|     4 | Camera                               | Camera operation principles and lenses                                            |
|     5 | Display                              | Display technologies and standards                                                |
|     6 | [[/Users/danielmcguiness/GitHub/MCI-Source-Files/(BSc - Lecture) Digital Image Processing/Lecture Slides/DIP Slide/codes/Noise.corg][Noise]]                                | Types of noise encountered and how to mode them                                   |
|     7 | [[/Users/danielmcguiness/GitHub/MCI-Source-Files/(BSc - Lecture) Digital Image Processing/Lecture Slides/DIP Slide/codes/Histogram-Operations.corg][Histogram Operations]]                 | Analysis of histogram, both in grey and colour, along with masking and stretching |
|     8 | [[/Users/danielmcguiness/GitHub/MCI-Source-Files/(BSc - Lecture) Digital Image Processing/Lecture Slides/DIP Slide/codes/Morphological-Operations.corg][Morphological Operations]]             | Morphological operators (i.e., dilation, gradient, ...)                           |
|     9 | [[/Users/danielmcguiness/GitHub/MCI-Source-Files/(BSc - Lecture) Digital Image Processing/Lecture Slides/DIP Slide/codes/Blurring-Filters.corg][Blurring Filters]]                     | Types of blurring filters used for noise reduction and smoothing applications     |
|    10 | Feature Analysis                     | Algorithms used to extract features from images                                   |
|    11 | Edge Detection                       | Methods and alhorithms used in detecting edges for computer vision                |
|    12 | [[/Users/danielmcguiness/GitHub/MCI-Source-Files/(BSc - Lecture) Digital Image Processing/Lecture Slides/DIP Slide/codes/Neural-Networks-for-Image-Processing.corg][Neural Networks for Image Processing]] | A Brief introduction to ANNs for use in image recognition                         |
|    13 | Appendix                             | Additional information related to the main topic                                  |
#+TAG-END: CORG-INDEX

** Code Supplement

The Code supplement is a Github webpage dedicated to hosting all the
relevant code used in the lecture as it is not feasible to fit all the
content of the code to the slides and it is easier to share this way.

[[https://dtmc0945.github.io/L-MCI-BSc-Digital-Image-Processing/][Visit the Code Supplement Website]]

** Reading List

The following materials are recommend reading for the coure but by no
means are they mandatory.

*Books*

1. Young I. "Fundamentals of Image Processing" Delft 1998.
2. Szeliski R. "Computer Vision: Algorithms and Applications"
   Springer 2022.
3. Nixon M. et. al "Feature Extraction and Image Processing for Computer
   Vision" Academic press 2019
4. Gonzalez R. "Digital Image Processing" Pearson 2009.
